{
  "precedentId": [
    {
      "id": "9766d88d-1e1f-4125-9011-62c77a3c8718",
      "version": "1"
    }
  ],
  "explanation": "The contract language only addresses service of process in litigation, allowing delivery by U.S. registered mail to an unspecified address “set forth below.” It does not establish a general notice provision for all communications under the NDA, does not list any physical or email addresses, and does not describe alternative delivery methods (e-mail, hand-delivery, overnight courier, etc.). Therefore it fails to satisfy the rule’s requirement that the NDA explicitly specify both the methods of notice and the addresses (email or physical) for each party.",
  "rule": "Specify the method and address for providing notices under the NDA, including email or physical address.",
  "exampleLanguage": "All notices, requests, waivers, and other communications under this Agreement must be in writing and are conclusively deemed to have been duly given: when hand-delivered to the other Party; when received if sent by facsimile or electronic mail to the number or email address set forth below, provided that the sending Party receives a confirmation of delivery; three (3) business days after deposit in the U.S. mail, with first class or certified mail, receipt requested, postage prepaid, and addressed to the other Party; or forty-eight (48) hours after deposit with an internationally recognized overnight delivery service, postage prepaid, addressed to the other Party as set forth below with next business-day delivery guaranteed, provided that the sending Party receives a confirmation of delivery from the delivery service provider. A Party may change or supplement the addresses, facsimile numbers, and email addresses provided in its signature block below, or designate additional addresses, facsimile numbers, or email addresses, for purposes of this Section by giving the other Party written notice of the new address, facsimile numbers, or email addresses in the manner set forth above."
}